import 'package:get/get.dart';

class Messages extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'zh_CN': {
          '首页': '首页',
          '名称:': '名称:',
          '电话:': '电话:',
          '地址:': '地址:',
          '照片:': '照片:',
          '通知': '通知',
          '未查询到地址信息': '未查询到地址信息',
          '客户无定位信息': '客户无定位信息:',
          '运单编号/会员编号': '运单编号/会员编号',
          '数据加载中..': '数据加载中..',
          '网络错误': '网络错误',
          '用户名或者密码错误!': '用户名或者密码错误!',
          '请求失败! 请稍后尝试!': '请求失败! 请稍后尝试!',
        },
        'ca_KH': {
          '首页': 'ទំព័រដើម:',
          '名称:': 'ឈ្មោះ:',
          '电话:': 'ទូរស័ព្ទ:',
          '地址:': 'អាសយដ្ឋាន:',
          '照片:': 'រូបថត:',
          '通知': 'សេចក្តីជូនដំណឹង:',
          '未查询到地址信息': 'មិនបានរកឃើញព័ត៌មានអាសយដ្ឋានទេ',
          '客户无定位信息': 'អតិថិជនមិនមានព័ត៌មានអំពីទីតាំងទេ',
          '运单编号/会员编号': 'លេខកូដ Waybill / លេខកូដសមាជិក',
          '数据加载中..': 'ទិន្នន័យកំពុងផ្ទុក..',
          '网络错误': 'កំហុសអ៊ីនធឺណេត',
          '用户名或者密码错误': 'ឈ្មោះអ្នកប្រើឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ',
          '请求失败! 请稍后尝试!': 'ការស្នើបានបរាជ័យ! សូមព្យាយាមពេលក្រោយ!',
          '请稍后尝试': 'សូមព្យាយាមនៅពេលក្រោយ',
          '请勿扫描二维码，应扫描一维码': 'កុំស្កេនលេខកូដ QR អ្នកគួរតែស្កេនលេខកូដមួយវិមាត្រ',
          '记住密码':'ចងចាំ​ពាក្យ​សម្ងាត់',
        },
        'en_US': {
          '首页': 'Home',
        }
      };
}
